[{"title": "COMP40250 Introduction to Cognitive Psychology", "credits": "7.5", "trimester": "Autumn", "lecturer": "Assoc Professor Fintan Costello", "description": "This module provides a thorough introduction to the core ideas in modern Cognitive Psychology.  As such, it will cover the main components of the cognitive system (e.g., working memory, long-term memory, thinking processes), sketching the key findings in psychology, computational models and neurological underpinnings throughout. The module will also involve group project work in designing, constructing, and running a cognitive experiment, right through to write-up."}, {"title": "COMP41400 Multi-Agent Systems", "credits": "5.0", "trimester": "Autumn", "lecturer": "Assoc Professor Rem Collier", "description": "This module aims to introduce students to the concept of multi-agent systems.  The course commences with a eview of the fundamental concepts that underpin agent-based systems,.Thereafter a number of topics will be covered including inter alia: agent reasoning technologies, agent communication languages, agent programming languages, coordination protocols agent planning and negotiation strategies.  Following this, the course explores how agent technologies have been successfully applied to a diverse range of application domains, such as mobile computing, virtual collaborative environments, and robotics.  During the course, students are required to evaluate an agent programming, framework that delivers structured support for the development and deployment of agent-oriented applications."}, {"title": "COMP47230 Introduction to Cognitive Scie", "credits": "7.5", "trimester": "Autumn", "lecturer": "Assoc Professor Fred Cummins", "description": "This module will provide a very broad brush overview of topics in cognitive science.  Topics covered will include something of the history of the sciences of mind, various approaches to perception and action, language, reasoning, social cognition, and consciousness.  It will strive to present multiple theoretical approaches that complement, and sometimes contradict, one another."}, {"title": "IS40610 UXD: User-Centered Design", "credits": "5.0", "trimester": "Autumn", "lecturer": "Assoc Professor Benjamin Cowan", "description": "Module DescriptionTechnology is now ubiquitously used in our everyday life. We have countless interactions with interfaces and information systems across our day be it with social media, mobile apps, as well as more traditional desktop oriented interactions. This course will explore the discipline of human-computer interaction (HCI), a discipline which focuses on the design of user-centred technology interactions and the effect that design and technology interaction has on people's behaviours, perceptions and emotions. The course will teach students 1)  how to design and evaluate technology interactions to ensure truly user centred design as well as 2) more theoretical insights on how interface design affects user behaviours, emotions and performance. Students will be asked to create their own design solution for a specific information system use case as well as deeply explore cutting edge research in an area of academic research in HCI. Students will be asked to think creatively, work together on a practical design led project as well as study in depth what it means to place the human at the centre of technology design. Registration to this module is open to MSc students. Note that 3rd year UG students who wish to take this course must get permission from the module co-ordinator before registering."}, {"title": "COMP40020 Human Language Technologies", "credits": "5.0", "trimester": "Spring", "lecturer": "Professor Julie Berndsen", "description": "Human Language Technology is a term which encompasses computational modelling of both language and speech. This module is structured in such a way as to present important concepts of speech and language technology research and how these concepts are used in practical applications. The module integrates theory and applications via a combination of lectures, workshop sessions and practical assignments. The module introduction is devoted to a brief overview of the underlying linguistic aspects of human language technologies, presented in terms of problems which have to be addressed when developing specific applications. An initial distinction is drawn between knowledge-based linguistic approaches and data-driven corpus-based approaches and examples of each are discussed in the context of the role they play in the domain of Computer Science and domain of Linguistics. The module then presents computational models of phonology, morphology, lexicon and syntax, all of which have a role to play in practical language technology applications. An overview of resources, toolkits and evaluation methodologies is provided and the principles of speech recognition, speech synthesis and other language technology applications are presented where knowledge-based and data-driven approaches are often combined."}, {"title": "COMP40260 Connectionism and Dynamical Systems", "credits": "7.5", "trimester": "Spring", "lecturer": "Assoc Professor Fred Cummins", "description": "The theory and practice of modeling with artificial neural networks will be presented as it is relevant to the study of human behaviour and cognition.  Models are closely related to human cognitive processes in general and to developmental processes and learning in particular.  This module does not aspire to teaching contemporary machine learning or deep learning, but rather to examine how connectionist and dynamical models have been and are used in theorising about humans. We will also cover basic concepts from dynamical systems theory and see how these are applied in modelling human behavior."}, {"title": "COMP40270 Cognitive Modelling", "credits": "7.5", "trimester": "Spring", "lecturer": "Assoc Professor Fintan Costello", "description": "Cognitive modeling is an area of research that deals with simulating human problem solving and mental processes in a computerized model. Such a model can be used to simulate or predict human behavior or performance on tasks similar to the ones modeled.  In this module we willl describe a number of different approaches to cognitive modelling, particularly focusing on models in the area of conceptual representation, semantics, and language.  As part of this module tudents will develop a cognitive model for some process in this area and test this model against experimental data."}, {"title": "COMP41710 Human Computer Interaction", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor David Coyle", "description": "Human-Computer Interaction (HCI) is a distinctive branch of computer science dedicated to understanding the relationship between people and computers. It provides a set of techniques that enable designers and software engineers to develop computing applications that better respond to the needs, abilities and interests of customers, clients and end-users. This module provides theoretical grounding, practical knowledge, and hands on experience of key skills needed to design and build better interfaces for computing systems.\n\nThe module addresses core areas of the ACM SIGCHI Curricula for Human-Computer Interaction and is intended for students with diverse disciplinary backgrounds and experiences, including Computer Science, Cognitive Science and Design.\n\nThe module covers the following core topics:\n1. Human cognition and models of interaction\n2. Usability and user experience\n3. Experimental design and statistics for HCI\n4. Interface design using user-centred and iterative methods\n5. Design thinking and rapid prototyping\n6. Qualitative and quantitative evaluation strategies\n\nIt also introduces advance topics within the field of HCI. For example:\n- Intelligent and next generation user interfaces\n- Information visualization\n- Social impact interfaces for health and sustainability\n\nAdvanced topics are addressed through concrete case studies of successful and innovative design projects."}, {"title": "COMP47410 Computational Creativity", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Tony Veale", "description": "Computational Creativity (CC) is a new branch of Artificial Intelligence andCognitive Science that explores the potential of machines to perform tasks in waysthat would be considered creative if performed by a human, or to generate outputsthat would be considered novel and interesting if generated by a human. As a field,CC focuses primarily on the latter, to explore the generative potential of machinesand to focus on the building of software systems that construct original artifacts(whether linguistic – as in stories, poems, jokes, slogans, tweets, etc. – or visual –such as collages, paintings, patterns etc. – or musical – such as jazz riffs, pieces ofclassical music, etc.)Given its focus on creativity in humans and machines, a course on CC necessarilymixes elements of cognitive science, psychology and philosophy into its corecomputational structure. The course should appeal to students with an interest increativity, or an interest in AI that is not served by courses that emphasis problem-solving. The course will be delivered through lectures and practical sessions, and willrequire students to build generative systems of their own. Weekly assignments willdovetail with the course project, so that work initiated in the assignments (andincrementally build upon each week) will be completed in the project.Lectures will involve instruction, discussion and debate about the nature of creativity,the potential of machines to be creative, and the practicalities of building creativesystems."}, {"title": "EEEN40050 Wireless Systems", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Barry Cardiff", "description": "This module deals with the analysis and design of wireless systems, mainly wireless communication systems.  The emphasis is on the design of transmitters (from modulated signal to antenna) and receivers (from antenna to demodulator), but the radio path and link budget will also be covered.   A good knowledge of analogue electronic circuits and electromagnetic waves will be required.  The radio-frequency (RF) blocks used in this module are covered at the circuit level in the module EEEN40150 RF Electronics.  Modulation and coding are covered in the module EEEN40060 Digital Communications."}, {"title": "EEEN40150 Radio-Frequency Electronics", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Anding Zhu", "description": "Fuelled by the huge expansion in the cellular networks and the emergence of an ever-wider range of data applications, wireless communication has been one of the fastest growing technology areas in the past 20 years and it is expected to continue to grow strongly over the coming decades. Wireless communication technologies have revolutionized how we live, and today, \"wireless\" is everywhere (home, office, classroom, hospital, etc.) and in everything (mobile phones, laptops, music players, cars, and so on). This course will look at the operational principles and hardware circuit design aspects of wireless systems from a radio frequency (RF) perspective. The course will cover many of the RF building blocks in wireless communication transceiver system: basic passive and active RF components, RF device models, transmission line principles, Smith charts, generalized matrix representation of RF circuits, analysis of multiport RF networks, lumped and distributed microstrip circuits, RF filters, RF amplifiers, RF oscillators and mixers.This course aims to convey to students an understanding of RF background for both the design and analysis of RF devices and circuits. The system-level aspects of wireless systems will be taught in the EEEN 40050 \"Wireless Systems\" module."}, {"title": "STAT40690 Quantitative Methods for Engineers", "credits": "5.0", "trimester": "Autumn", "lecturer": "Assoc Professor Patrick Murphy", "description": "This module is aimed at all students in Engineering who are studying for Masters programmes. The module will introduce students to research methods in Engineering.We will explore fundamental principles of importance in all quantitative research including Bias, Representativeness, Variability, Sampling, Randomisation etc.We will look in detail at how data should be collected including Survey Design, Sample Design and Design of Experiments.We will consider how data should be summarised and described.We will examine some common statistical techniques used in inferential statistics.Finally we will consider how the results of our studies should be reported.The emphasis throughout this module will be on supplying students with the knowledge and skills required to perform studies of their own and to critically evaluate studies in the literature."}, {"title": "COMP40010 Performance of Computer Systems", "credits": "5.0", "trimester": "Spring", "lecturer": "Professor Liam Murphy", "description": "This module provides students with an introduction to performance engineering applied to software systems, including cloud-based systems. Topics may include Measurement Techniques and Tools, Probability and Queueing Models, Test Design and Analysis, and Simulation. The practical work will test skills and techniques for performance assurance and testing, including some or all of the following: design of performance tests; model generation; model analysis using a commercial or open-source simulator or spreadsheet; analysis and presentation of results."}, {"title": "COMP40660 Advances in Wireless Networking", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Madhusanka Liyanage", "description": "Overview of current and future wireless technologies, with an emphasis on networking and application aspects; overview of mobile/cellular systems; discussion of relevant IEEE standards (e.g. 802.11 and 802.16); introduction to mobile/wireless applications."}, {"title": "EEEN40060 Digital Communications", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Mark Flanagan", "description": "This module deals mainly with the theoretical underpinning of modern digital communication systems.  It will give a firm understanding of the principles behind modern physical-layer line and wireless communications.  Digital modulation techniques and decision theory are described through the use of signal space theory.  The module also includes an introduction to information theory and channel coding.  Advanced modulation and coding techniques will be covered such as OFDM, convolutional codes and Viterbi decoding, and low-density parity-check coding. Students will be required to write computer simulations of various communication systems. Specific topics include:* Decision theory and optimum detection over the discrete memoryless channel* Signal space theory (optimum receiver design, probability of error)* Digital modulation techniques (BPSK, QPSK, MPSK, FSK, PAM, QAM, OFDM)* Channel coding techniques (block codes, convolutional codes and Viterbi decoding, low-density parity-check codes)* Information theory (entropy, mutual information, channel capacity),"}, {"title": "EEEN40280 Digital & Embedded Systems", "credits": "5.0", "trimester": "Spring", "lecturer": "Mr Brian Mulkeen", "description": "This module deals with the design and implementation of complex digital systems, involving application-specific hardware, an embedded processor and software.  Topics include architectures and interfacing of typical processors, programming in C and assembly language to interact with hardware in real time, design and verification of systems involving a mix of hardware and software.\n\nThe module will have an emphasis on problem-based learning.  Design assignments will require significant time during the trimester, and will involve working in a team and collaborating with others.  Assessment of these assignments will be largely based on written reports, supplemented by interview where necessary."}, {"title": "IS40630 Digital Curation:Core Concepts", "credits": "10.0", "trimester": "Autumn", "lecturer": "Dr Amber Cushing", "description": "Digital material is ubiquitous.   However, if this data is not cared for, it will not be accessible in the future.  Until recently, preservation, applied well after the digital item was created, had been the main method used to maintain digital materials over time.  However, new technologies have raised additional challenges beyond which preservation can address.  It has become clear that maintaining digital material needs to start before the point of creation, to ensure continued access over time.  This course provides an introduction to the digital curation lifecycle as a strategy to manage the creation, conservation, and preservation of and long term access to digital materials. \n\nIn this module you will engage with digital curation theory, engage in practice via a team project and experiment with digital curation tools in a series of mini-workshops."}, {"title": "IS41090 Informatics", "credits": "10.0", "trimester": "Autumn", "lecturer": "Dr Duncan Wallace", "description": "The process of information creation, storage, and access are core interests in the study of informatics. These processes are inextricably tied to web based applications, the use of which is prevalent in many aspects of daily life and are a core component of modern industries. These systems are typically predicated on the exposure of some underlying structured storage of data in a contextual way to clients in the form of a web interface. These types of applications include online shops (e.g. Ebay, SuperValu.ie), social media platforms (e.g. Facebook, Tumblr), online encyclopedias (e.g. Wikipedia, Scholarpedia) and even content management systems (e.g. Wordpress, Drupal).\n\nThis module will discuss some of the technologies underpinning these applications and the underlying principles of how such applications are developed. Attention will be paid to the manner in which data can be stored, and practical means of accessing and delivering information to a frontend. Students can expect to obtain both practical experience and theoretical knowledge relating to the development of such systems."}, {"title": "SOC40640 Social Simulation: Methods and Models", "credits": "10.0", "trimester": "Autumn", "lecturer": "Dr Pablo Lucas", "description": "This module is grounded on key concepts of analytical sociology, with particular focus on agent-based models. Social dynamics is defined as the set of potentially heterogeneous individual behaviours and its ensuing collective outcomes. Throughout the trimester you are expected to engage in discussions regarding the understanding of influences of both micro (local or individual) and macro (global or collective) dynamics."}, {"title": "IS40560 Digital Libraries", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Lai Ma", "description": "Digital libraries offer exciting possibilities for providing access to digital and digitised content, but raise numerous technical, social, and organisational challenges.  This module will examine some of the issues associated with the evolving concept and development of digital libraries and create a small DL of their own.  Topics will include the evolution of digital libraries; their social, technical, and related dimensions; the creation and management of digital resources, including data and data repositories; and digital library services, use, and users."}, {"title": "GEOG40820 Introduction to ArcGIS", "credits": "10.0", "trimester": "Autumn", "lecturer": "Dr Tobi Morakinyo", "description": "Geographic Information Systems (GIS) allow the acquisition, storage, analysis and visualisation of location-based data. GIS are increasingly applied in research and practice across a wide range of disciplines and sectors (e.g. planning, demographics, health, social and environmental sciences) and, as such, GIS skills are valuable, transferable and highly sought after. \n\nThis module will introduce students to ArcGIS, the most widely used GIS software package. It will enable students developing an understanding of conceptual, theoretical and practical geographical considerations and, most importantly, gaining practical GIS skills for their use and application. These skills will cover spatial data creation, sourcing, management, mapping and geoprocessing.\n\nThe module is largely delivered through hands-on computer lab-based practicals, complemented with lectures that will cover theory and analytical themes that GIS are designed to handle. The practicals will focus on the analysis, visualisation and interpretation of spatial data to support environmental and socio-economic assessments, using demonstrative examples and problem-solving exercises. A significant part of the learning will be self-directed, allowing students to develop their skills and spatial awareness through the design and delivery of a spatial analysis project, tailored to individual research and/or interests."}, {"title": "COMP40610 Information Visualisation", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Colm Ryan", "description": "This module is suitable for students interested in the fundamental and practical underpinnings of Information Visualisation. Information Visualisation is a research area that focuses on the use of graphical techniques to present data in an explicit form. Such static or dynamic presentations (pictures) help people formulate an understanding of data and an internal model of it for reasoning about. Such pictures of data are an external artifact supporting decision making. While sharing many of the same goals of Scientific Visualisation, Human Computer Interaction, User Interface Design and Computer Graphics, Information Visualisation focuses on the visual presentation of data without a physical or geometric form. As such it relies on research in mathematics, data mining, data structures, algorithms, graph drawing, human-computer interaction, cognitive psychology, semiotics, cartography, interactive graphics, imaging and visual design.This module explores the most important topics in information visualsiation addressing both practical and theoretical concerns. Specific tools for creating data visualsiations are also explored."}, {"title": "COMP40725 Introduction to Relational Databases and SQL Programming", "credits": "10.0", "trimester": "Spring", "lecturer": "Assoc Professor Tony Veale", "description": "Collection, organisation and storage of data are major tasks in many human activities and in every modern computing system. Computer-based information systems ensure that this data is permanently maintained, quickly updated and made accessible to users. Databases are essential components of computerised information systems. This is a module for all students interested in understanding how to design, develop and query databases. In this module, students will learn the fundamentals of database models, database designing methodologies, database querying and database normalisation theory. They will learn details about the relational database model, relational database query languages (relational algebra, SQL, PL/SQL), the entity-relationship model for database design, Third and Boyce-Codd Normal Forms. From a more practical point of view they will gain experience in building a relational database using industry standard database management systems. Students will find these skills very useful in the development of any application requiring the storage and manipulation of data."}, {"title": "COMP40370 Data Mining", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Tahar Kechadi", "description": "The course is structured in such a way as to present important concepts of data mining and how these concepts are implemented and used in real-world applications. The key idea behind this course is to integrate the theory and practice of data mining with many references to real-world problems and cases to illustrate the concepts and the implementation issues as we go through the lectures. The first chapter is devoted to a brief introduction to some background information needed to understand the material. This is followed by data warehouse topic and how different is from database concept. The notion of data mining process is explained and how it relates to the complete KDD process, as it is very important to understand that data mining is not an isolated subject. We will then overview a survey of some techniques used to implement data mining algorithms. We will follow by studying some core topics of data mining; classification ,clustering, and association rules. Other concepts, such as prediction, regression , and pattern matching, will also be covered, but viewed as special cases of the three core topics. In each concept we will only concentrate on the most popular techniques and algorithms."}, {"title": "COMP41390 Connectionist Computing", "credits": "5.0", "trimester": "Autumn", "lecturer": "Assoc Professor Gianluca Pollastri", "description": "There are two distinct parts to this unit. In the first few lectures I will provide the students with a general overview of connectionism: its origins as an attempt to model the functioning of the brain, and the various classes of algorithms created starting from these foundations. In the second part I will zoom in on the last 10-15 years. I will focus on a general framework for designing machine learning models that deal with complex structured data. I will introduce graphical models and bayesian networks and describe inference and learning algorithms for them.In machine learning there are many details one doesn't want to talk about in public. During the class I will try to address some of these issues for the case of neural networks, i.e. to describe possible strategies for effectively training them in real-world scenarios.Throughout the class and especially towards the end I will show applications of connectionist models to real problems. Together with more classical fields such as image classification and language processing, I will spend some time on applications to biological data, which has been the main focus of my research for the last few years."}, {"title": "COMP47460 Machine Learning (Blended Delivery)", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Aonghus Lawlor", "description": "The objective of this module is to familiarise students with the fundamental theoretical concepts in machine learning, as well as instructing students in the practical aspects of applying machine learning algorithms. Key techniques in supervised machine learning will be covered, such as classification using decision trees and nearest neighbour algorithms, and regression analysis. A particular emphasis will be placed on the evaluation of the performance of these algorithms. In unsupervised machine learning, a number of popular clustering algorithms will be presented in detail. Further topics covered include ensemble learning, dimension reduction, and recommender systems. COMP47490 requires strong mathematical ability, as some of the algorithms require some understanding of linear algebra and statistical concepts."}, {"title": "COMP47600 Text Analytics", "credits": "10.0", "trimester": "Autumn", "lecturer": "Professor Mark Keane", "description": "This course aims is to cover how text analytics is currently used to find important regularities and discover meaning in big data.  As such, the course will cover the fundamental techniques and some sample application areas where text analytics is deployed.  Initially, the course will cover how raw textual data is pre-processed, the natural language techniques (NLP) used to prepare data for subsequent analysis and the paradigms used for system evaluation.   The key techniques used in text analytics will be reviewed; including techniques for computing similarity, classification and clustering of texts,  sentiment analysis, and discovering temporal regularities.   Classic examples of text analytics from social media, polling, predictive analytics and news media will be discussed as examples of the application of these techniques."}, {"title": "COMP47750 Machine Learning with Python", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Pádraig Cunningham", "description": "The objective of this module is to familiarise students with the fundamental theoretical concepts in machine learning, as well as to instruct students in the practical aspects of applying machine learning algorithms. Key techniques in supervised machine learning will be covered, such as classification using decision trees and nearest neighbour algorithms, and regression analysis. A particular emphasis will be placed on the evaluation of the performance of these algorithms. In unsupervised machine learning, a number of popular clustering algorithms will be presented in detail. Further topics covered include ensemble learning, dimension reduction, and recommender systems. This module requires strong mathematical ability, as some of the algorithms require some understanding of linear algebra and statistical concepts. Exercises and assignments will use the machine learning libraries in Python."}, {"title": "COMP47790 Optimisation", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Deepak Ajwani", "description": "This module is an introduction to basic optimisation techniques, including gradient-based approaches, linear programming, mixed integer linear programming, meta-heuristics and combinatorial optimisation."}, {"title": "COMP47580 Recommender Systems & Collective Intelligence", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Neil Hurley", "description": "Recommendation technologies have become an important part of our online experiences, helping us to discover books, movies, and music that are relevant to our likes and preferences. So much so, in fact, that recommender systems are now a fundamental component of most e-commerce platforms, streaming services, and other content sites. At their core recommender systems operate by learning about the likes and dislikes of individuals and groups of users so that they may proactively tailor content for these users.In this course we will cover the fundamentals of recommender systems technologies including the main approaches to building and evaluating recommender systems (content-based vs collaborative filtering vs hybrid approaches) as well as a variety of more advanced topics.This module will be assessed by continuous assessment only which will take the form of in-class tests and practical projects and reports related to the development of recommender systems technologies.Please note that proficiency in the Java Programming Language is required."}, {"title": "COMP47590 Advanced Machine Learning", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Brian Mac Namee", "description": "COMP47590 is an advanced module on Machine Learning that builds on the core concepts covered in COMP47490 or COMP47460. Either COMP47490 or COMP47460 is a prerequisite for this module.  This module covers advanced, state of the art topics in machine learning in areas such as deep learning, ensemble methods, semi-supervised learning, human-in-the-loop machine learning, unsupervised machine learning, reinforcement learning, and social network analysis. Significant prior programming experience is essential (in either Java, Python or C/C++)."}, {"title": "COMP47650 Deep Learning", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Guenole Silvestre", "description": "Recent advances in machine learning have been dominated by neural network approaches broadly described as deep learning. This module provides an overview of the most important deep learning techniques covering both theoretical foundations and practical applications. The applications focus on problems in image understanding and language modelling and use appropriate state-of-the-art deep learning libraries and tools which are introduced in the module.\n\nPrerequisites: Machine Learning (or similar), strong programming ability (Python or similar languages), strong mathematical ability (especially linear algebra and differential calculus, optimisation)"}, {"title": "STAT40750 Statistical Machine Learning (online)", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Michael Fop", "description": "Statistical Machine Learning encompasses a collection of techniques for discovering patterns in data and making predictions, involving models and methods at the intersection of Machine Learning and Statistics. With the aim of introducing the students to a set of techniques for the analysis of complex data, this module provides an overview of a variety of statistical learning methods for unsupervised and supervised learning. Focus will be placed on the understanding, the critical evaluation and the appropriate application of the different techniques in different data analysis scenarios. \n\nThe module will cover also how to implement these statistical learning methods using the statistical software R."}, {"title": "COMP47470 Big Data Programming", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Anthony Ventresque", "description": "`Big Data’ refers to datasets that are too big, or change too quickly, for traditional data management and data processing approaches. Big Data has forced the field of data management to rethink some of its design concepts and architectural patterns. This module will walk the students through the complex set of concepts and projects that form the Big Data stack. Students will learn how to set up Big Data environments, how to use efficient data management operations and how to run algorithms – to the scale and speed required by Big Data datasets. Students will also be able at the end of this module to design and implement their own solutions to address Big Data problems."}, {"title": "STAT40620 Data Programming with R", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Claire Gormley", "description": "This module introduces students with no previous programming experience to the open-source statistical programming language R. Topics include: manipulating vectors, matrices, arrays and lists; basic programming constructs and programme flow; graphical methods; dealing with large data sets; simple statistical methods."}, {"title": "STAT40720 Introduction to Data Analytics (Online)", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Michael Salter-Townshend", "description": "This module covers introductory probability and statistical inference, focusing on understanding concepts and methodologies. Topics include: descriptive statistics, probability, sampling distributions, confidence interval estimation, hypothesis testing and regression."}, {"title": "STAT40730 Data Programming with R (Online)", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Claire Gormley", "description": "This module introduces students with no previous programming experience to the open-source statistical programming language R. Topics include: manipulating vectors, matrices, arrays and lists; basic programming constructs and programme flow; graphical methods; dealing with large data sets; simple statistical methods."}, {"title": "STAT40800 Data Prog with Python (online)", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Áine Byrne", "description": "In this module students will learn how to manipulate data and perform statistical analysis using Python. \n\nThis module covers a range of topics, including (but not limited to):\n- structure of the Python language\n- data manipulation \n- data visualisation\n- statistical analysis\n- regression and classification\n- machine learning and clustering algorithms\n- APIs and webscraping\n- string manipulation and regular expressions\n\nNOTE: This is a purely online module. All content is delivered asynchronously. There are no face-to-face lectures or tutorials."}, {"title": "COMP41680 Data Science in Python", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Derek Greene", "description": "The key objectives of this module are 1) to provide students with an initial crash course in Python programming; 2) to familiarise students with a range of key topics in the emerging field of Data Science through the medium of Python. Students will start by exploring methods for collecting, storing, filtering, and analysing datasets. From there, the module will introduce core concepts from numerical computing, statistics, and machine learning, and demonstrate how these can be applied in practice using popular open source packages and tools. Additional topics that will be covered include data visualisation and working with textual data. This module has a strong practical programming focus and students will be expected to complete two individual coursework assignments, each involving implementing a Python solution to a data analytics task. \n\nNOTE: COMP41680 requires a reasonable level of prior programming experience (but not necessarily in Python)."}, {"title": "COMP47670 Data Science in Python (MD)", "credits": "5.0", "trimester": "Autumn and Spring (separate)", "lecturer": "Professor Pádraig Cunningham", "description": "Please note the Autumn trimester offering of this module is not available for general registration.\n\nThe key objectives of this module are \n1) to provide students with an initial crash course in Python programming; \n2) to familiarise students with a range of key topics in the emerging field of Data Science through the medium of Python. \nStudents will start by exploring methods for collecting, storing, filtering, and analysing datasets. From there, the module will introduce core concepts from numerical computing, statistics, and machine learning, and demonstrate how these can be applied in practice using popular open source packages and tools. Additional topics that will be covered include data visualisation and working with textual data. This module has a strong practical programming focus and students will be expected to complete two detailed coursework assignments, each involving implementing a Python solution to a data analytics task. COMP47670 requires a reasonable level of mathematical ability, and students should have prior programming experience (but not necessarily in Python).\nThis is a Mixed Delivery module with online lectures and face to face practicals/toturials."}, {"title": "COMP41720 Distributed Systems", "credits": "5.0", "trimester": "Autumn", "lecturer": "Assoc Professor Rem Collier", "description": "Distribution is a key technology for constructing systems that can scale to meet high demand (such as web applications) or which are required to operate over large geographical areas (such as Sensor Networks). Understanding how to do this effectively is an important challenge in computer science, especially given the continued emergence of systems that are required to handle millions of concurrent users (Facebook, Google, Linkedin, Amazon, Wallmart, Netflix,...) where fluctuations in usage necessitate the addition or removal of servers to meet that changing demand.\n\nThis module explores this space from a practical perspective. Students will learn about and use a range of distribution techniques. They will explore the state-of-the-art and key theoretical issues by reviewing academic articles describing some of the most successful approaches developed to date. A final project will allow the students to apply these techniques through the development of a significant application."}, {"title": "COMP47780 Cloud Computing", "credits": "10.0", "trimester": "Autumn", "lecturer": "Professor Tahar Kechadi", "description": "Cloud Computing (CC) is one of the key evolution steps of Information and Communication Technology (ICT). It provides computing as a utility, which has emerged as a commercial reality. It typically involves over-the-Internet provision of dynamically scalable resources. In other words, CC is a style of computing in which virtualised resources are provided as a service over the Internet.  Nowadays, cloud services are increasingly common technologies used by many organisations to add flexibility, efficiency, and innovation to their business.  This module starts by introducing the key concepts behind Cloud Computing (distributed and parallel computing). Next, it covers the cloud computing deployment and delivery models, large-scale systems architectures, with a specific focus on some existing data stores, distributed computing and Distributed file systems (e.g., Hadoop File System, Google File System, …). Then it focuses on techniques for processing big data (the Map/Reduce model), and all the necessary programming tools that simplify the generation of Map/Reduce implementation of applications, such as Apache Pig, Hive, … Other concepts, such as security and the economics of the Cloud, will also be covered. Finally, some existing clouds such as Hadoop, Google Cloud, Microsoft Azure, Amazon cloud (AWS) will be presented, compared."}, {"title": "ACM40290 Numerical Algorithms", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr James Herterich", "description": "MATLAB programming: Data types and structures, arithmetic operations, functions, input and output, interface programming, graphics; implementation of numerical methods.\n\nIntroduction: Finite floating point arithmetic, catastrophic cancellation, chopping and rounding errors.\n\nA selection of the following topics will be covered:\n\nSolution of nonlinear equations: Bisection method, secant method, Newton's method, fixed point iteration, Muller's method.\n\nNumerical optimization: Newton's optimization method.\n\nSolutions of linear algebraic equations: Forwarding Gaussian elimination, pivoting, scaling, back substitution, LU-decomposition, norms and errors, condition numbers, iterations, Newton's method for systems, computer implementation.\n\nInterpolation: Lagrange interpolation, Newton interpolation, inverse interpolation.\n\nNumerical Integration: Finite differences, Newton cotes rules, trapezoidal rule, Simpson's rule, extrapolation, Gaussian quadrature.\n\nNumerical solution of ordinary differential equations: Euler's method, Runge-Kutta method, multi-step methods, predictor-corrector methods, rates of convergence, global errors, algebraic and shooting methods for boundary value problems, computer implementation.\n\nNOTE: Students must have a laptop computer."}, {"title": "STAT40400 Monte Carlo Inference", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Silvia D'Angelo", "description": "Computers have to a large extent changed what is now possible for Statistics. A rough classifiction of the uses of computers in modern Statistics might be: Graphical data exploration; data modelling; inference. This course focuses exclusively on inference. It aims to introduce a collection of powerful and computationally intensive modern Statistical methods. In particular this course will introduce concepts and methods involved in simulating from distributions. In turn this allows many familiar concepts such as point estimation, confidence intervals, maximum likelihood estimators to be computed. This course will introduce and make use of the free statistical software package R (www.r-project.org)."}, {"title": "STAT40700 Time Series Analysis - Act App", "credits": "5.0", "trimester": "Autumn", "lecturer": "Dr Michael Salter-Townshend", "description": "This course provides an opportunity for students to learn some basic techniques in Time Series Analysis. A Time Series is a set of measurements taken at regular intervals over a period of time. Time series pervade the worlds of economics and finance e.g. equity prices, (CPI) inflation, GNP, GDP, derivative prices, oil prices, etc. Although the techniques of Time Series Analysis are used by many people, from meteorologists to astronomers, this course will mainly focus on examples in the world of economics and finance. This course will show how to model such data and how using those models forecasts and predictions can be made.Time series analysis is not a new subject, however there have been many advances in recent years and the 2003 Nobel prize in Economics was awarded to Engle and Granger for their work in time-series econometrics. This course will cover both traditional methods and more modern approaches to Time Series Analysis. Upon completion of this course students should have mastered techniques that are extremely valuable for careers in the analysis of economic and financial data. Topics covered include, among others: Stationarity, ARIMA models, Parameter Estimation, Forecasting and Cointegration. Additional topics may be included which may vary from year to year."}, {"title": "STAT40150 Multivariate Analysis", "credits": "5.0", "trimester": "Spring", "lecturer": "Professor Claire Gormley", "description": "Multivariate analysis considers many response variables simultaneously. This module will cover many of the common techniques used to analyze multivariate data: clustering techniques, classification techniques, ordination techniques such as principal components analysis and graphical techniques such as multidimensional scaling. The emphasis will be on understanding the methodology, applying it using statistical software and the subsequent interpretation of standard output. This course will introduce and make use of the free statistical software R (www.r-project.org)."}, {"title": "STAT40740 Multivariate Analysis (Online)", "credits": "5.0", "trimester": "Spring", "lecturer": "Professor Claire Gormley", "description": "This module will cover many common statistical techniques used to analyse high dimensional data. Topics include: clustering techniques; classification techniques; ordination techniques such as principal components analysis; and graphical techniques such as multidimensional scaling. All analyses will be conducted using the R software."}, {"title": "COMP47530 Exploring Ruby (Mixed Delivery)", "credits": "5.0", "trimester": "Autumn", "lecturer": "Professor Mark Keane", "description": "The course will cover the Ruby programming language, introducing its main programming constructs (e.g., variable assignment, iterative constructs, conditionals, recursion) with a strong practical emphasis on system building. The Rails software framework will also be  introduced and its importance to web-system design.  Throughout the course functional and object-oriented programming aspects of Ruby will be  emphasised.  The module will have a mixed-delivery format, with the lectures being delivered online and practical hours delivered in face-to-face sessions.  Students will carry out weekly, self-directed coursework supported by periodic face-to-face practicals to provide guidance and feedback."}, {"title": "COMP47390 Mobile App Dev - Cocoa Touch", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Guenole Silvestre", "description": "This module provides a practical introduction to programming on iOS platforms using CocoaTouch and several other frameworks of the iOS SDK. Programming language is swift. Pre-requisites are Object Oriented Programming (ideally python, java, swift), Graphics, Software Engineering. In addition, it is required that students have access to a computer operating macOS and an iOS device, with both supporting the current release of the operating system. Syllabus will included the following topics: \n\nOverview of the iOS SDK, \nSwift programming language, Foundation classes, \nDesigning user interfaces using the Xcode software development tools,\nCocoaTouch and UIKit framework, multitouch gesture recognition\nModel-View Controller paradigm: Data driven models, Controller hierarchy, Standard and custom views,\nPerformance Optimization and Threads\nBasic Animation, Multimedia & Graphics\nLocation awareness (CoreLocation and MapKit frameworks)\n\nNote: this module requires strong programming skills"}, {"title": "COMP47500 Advanced Data Structures in Java (O/L)", "credits": "10.0", "trimester": "Spring", "lecturer": "Professor Eleni Mangina", "description": "This module is suitable for students with experience in Java programming language and interested in the design and analysis of efficient algorithms and data structures. This module will emphasise on ways of storing data in a computer so that it can be used efficiently (a data structure). A well-designed data structure or algorithm allows a variety of critical operations to be performed using as little resource, both execution time and memory space, as possible. COMP47500 will cover Stacks, Queues, Deques, Priority Queues, associative memory structures (Dictionaries), linked structures (Graphs), text processing and representation, as well as the core algorithms that complement each structure. A range of implementation techniques are examined, with emphasis being given to the complexity of the various solutions and their applicability to different problem domains."}, {"title": "COMP40400 Bioinformatics", "credits": "5.0", "trimester": "Spring", "lecturer": "Assoc Professor Gianluca Pollastri", "description": "-Proteins. DNA. RNA. Public molecular biology repositories.\n-Dynamic programming algorithms for sequence comparison: global sequence alignment (Needleman-Wunsch); local sequence alignment (Smith-Waterman); semiglobal comparison. Variations to the basic alignment algorithms: variable gab penalties; KBand; substitution matrices. BLAST. \n-Multiple sequence alignments. ClustalW.\n-Introduction to molecular phylogenetics. Methods for tree reconstruction: distance-based methods (UPGMA, Neighbour-Joining); maximum parsimony; maximum likelihood and full bayesian; bootstrapping. \n-Introduction to protein structure prediction. Introduction to artificial neural networks. Protein structure prediction by machine learning: 1D structural features; 2D structural features; 3D reconstruction."}, {"title": "COMP41280 Introduction to Information Security", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Félix Balado Pumarino", "description": "This course provides an introduction to the theoretical and practical underpinnings of information security. Information security is a broad field, encompassing all forms of information protection. The main focus of this course is on cryptographic primitives, an important set of tools on which information security usually relies. We start by studying the fundamentals of cryptography, and then we go on to address practical cryptography, digital signatures, and authentication. The course ends with a review of the fundamentals of digital data hiding (watermarking and steganography) and digital forensics, which are fields unrelated to cryptography."}, {"title": "BMOL40350 Business Planning for the Scientific Enterprise", "credits": "5.0", "trimester": "Spring", "lecturer": "Dr Antonio Garzon Vico", "description": "This course is designed to help you understand the concepts, frameworks and techniques needed to bring a scientific discovery to commercialisation with a compelling business plan. We divide the course into two major areas. First, we present the basic assumptions behind the design of a business plan. In particular, we draw on concepts from Business Strategy to help you analyse the opportunities and challenges in the industry and the business capabilities necessary to commercialise a scientific discovery.   Second, we look at the practicalities of writing a competitive business plan (e.g. format, structure, style). \n A key aim of this course is to enhance your ability to critically think through the practical implications of these topics.  Therefore, this course takes a problem based learning approach and presents you with theories in connection with real cases in modern science based organizations and entrepreneurship. To help you achieve this, we will discuss theory and frameworks together with real cases and will encourage your participation in the discussion. \nYou will be assessed on your ability to analyse real science-based business cases and to come up with a workable business plan for a real scientific discovery. Your work will be assessed on both individual and group projects."}, {"title": "MEEN40670 Technical Communication", "credits": "5.0", "trimester": "Autumn and Spring (separate)", "lecturer": "Mr Barry Brophy", "description": "See Video•\tThis module looks at some of the principles of communication in technical topics, applied to both oral (primarily) and written communications.•\tThree group presentations will be given in front of the class with an accompanying report to explain how that communication was created and planned. These will be spread out across the semester and individual feedback given each time. There will be video feedback of the second assignment.•\tThere is no end-of-term exam. There is a one-hour in-semester theory exam which will be carried out during one of the lecture slots.•\tThe content of the module has a solid grounding in fields of cognitive and educational psychology and does not draw on unfounded rules-of-thumb such as ‘one slide per minute’ or ‘no more than 5 words per bullet point’.•\tThere will be a large degree of creativity and self-learning. Students will be asked to select their own case study material, their own communication topics, and devise their own approaches to each exercise.•\tThere will be peer-review and discussion of the various deliverables.•\tLive lectures will be dedicated to activities that cannot be taught through notes, such as video clips, case studies, discussions, group feedback and brainstorming. There will not be scheduled letures for every lecture-slot in the timetable, but students will be expected to attend the sessions that are scheduled."}, {"title": "MEEN40820 Technical Comms (Online)", "credits": "5.0", "trimester": "Autumn and Spring (separate)", "lecturer": "Mr Barry Brophy", "description": "See sample lessonWhat will I study?This module focuses on making presentations. To do this an understanding of the entire communication chain is required (eg. handouts, questions, follow-up meetings etc.) It works off the assumption that you already have the skills necessary to make a presentation – your conversational skills. The challenge is to set out your material in an audience-friendly so that you can deliver it with the same style, and as easily, as if you were talking to a friend.How will I study? (delivery methods e.g., online videos, live lectures, tutorials etc)The module will include:•\tExtensive set of videos demonstrating best practice and conversational techniques.•\tThemed podcasts edited from interviews with people who present as part of their jobs.•\tSmall-group work for preparing for each presentation task.•\tDiscussion boards and several scheduled live group/class discussions.•\t2 sessions, on UCD campus, during the term to deliver group presentations.•\tOnline feedback sessions on presentations.Expected CommitmentStudents are not required to attend lectures on the UCD campus. However they are expected to view all of the 14 online lessons (in place of lectures) that have been posted.Also, to deliver each of the presentation tasks, students are required to attend 2 separate sessions during the term to make group presentations and receive feedback. These dates are not fixed and there may be more than one date for each deliverable (different groups present on different days) to facilitate participants’ varied commitments.Finally there will be a 1-hour in-term theory exam at 1-2pm on the Saturday of week 9 or 10 (TBC) at UCD, Belfield. This isl worth 20% of the total marks."}, {"title": "COMP40730 High Performance Computing", "credits": "10.0", "trimester": "Autumn", "lecturer": "Assoc Professor Alexey Lastovetsky", "description": "This module is suitable for students who are experienced programmers, with knowledge of the C/C++ programming languages. The aim of this module is to introduce students to design and development of parallel programs for different parallel architectures. There is a particular emphasis on practical implementation of shared-memory parallel algorithms using Pthreads and OpenMP and message-passing parallel algorithms using the message-passing interface MPI with the C programming language. \nStudents are introduced to some simple but typical computationally intensive problems and strategies for solving these problems on multi-processor machines are introduced. Methods to analyse the performance of parallel algorithms on the executing parallel architecture are also introduced.  Students are required to implement and experiment with a number of parallel applications. Topics covered in the module include: Vector and superscalar processors: architecture and programming model, optimizing compilers (dependency analysis and code generation), array libraries (BLAS), parallel languages (Fortran 90); Shared-memory multi-processors and multicores: architecture and programming models, optimizing compilers, thread libraries (Pthreads), parallel languages (OpenMP); Distributed-memory multi-processors: architecture and programming model, performance models, message-passing libraries (MPI); Hybrid parallel computing on lusters of multicore CPUs with MPI+OpenMP.\n\nNB.  This is a professional module which is part of a professional MSc"}, {"title": "MIS40850 Comparative Software Eng Process Frameworks", "credits": "10.0", "trimester": "Autumn", "lecturer": "Mr Allen Higgins", "description": "This module introduces contemporary Agile approaches to software practice (e.g. extreme programming and SCRUM), and contrasts them with software engineering process systems or frameworks like CMMI. Agile initiatives such as extreme programming and SCRUM have reinvigorated the field of software engineering and our understanding of programming's practices, processes, and structure. We ask how to better organise, control, and perform the production of software in teams. The goals of this module are twofold: 1) To develop knowledge and theories dealing with the management, performance and behaviour of collaborative digital design teams, and 2) to integrate the diverse concepts and theories of software practice and process frameworks; to translate these concepts into personal, team, and management practice."}, {"title": "COMP40040 Agent-Oriented Software", "credits": "10.0", "trimester": "Spring", "lecturer": "Assoc Professor Rem Collier", "description": "This module covers the tools and techniques of agent-oriented systems, including practical experience with applying these techniques to modern research-led problems using state-of-the-art agent programming platforms.\n\nNB.  This is a professional module which is part of a professional MSc"}, {"title": "COMP40080 Knowledge-based Techniques for Industrial Systems", "credits": "10.0", "trimester": "Spring", "lecturer": "Assoc Professor Tony Veale", "description": "An intelligent system can be characterised by what it knows: that is, what it knows about a domain, and what it knows how to do in that domain.  Knowledge has always defined the scope and limits of an intelligent system, and the representation of knowledge -- in combination with computational techniques for exploiting different representations -- has long been a foundational aspect of intelligent system design.\n\nThis course will explore knowledge-based techniques for the development of intelligent, knowledge-based systems. We will consider structured knowledge, semi-structured information and unstructured data, and examine the approaches most appropriate to each. The course will span information indexing and retrieval; semantic networks, taxonomies, and ontologies; knowledge sharing, interchange and publishing; XML and XMLS; RDF and RDFS; OWL and the Semantic Web; tools for building and exploiting these approaches; and semantic technologies construed more broadly.These knowledge-based technologies will be placed in their proper context, against the accelerating pace of innovation with more-data-intensive approaches to building intelligent systems."}]